In [1]:
from data.get_data import get_data
import pandas as pd

In [2]:
cities = get_data('cities')
cities

successfully connected to postgres+psycopg2://sandrinevuachet:postgres@localhost:5432/final_project

      id                      name
0      1         AMBÉRIEU-EN-BUGEY
1      2                  AMBRONAY
2      3                 ANGLEFORT
3      4                     ARANC
4      5                    ARBENT
..   ...                       ...
985  986         SÉVÉRAC D'AVEYRON
986  987  VILLEFRANCHE-DE-ROUERGUE
987  988  VILLEFRANCHE DE ROUERGUE
988  989                    VIVIEZ
989  990           AIX-EN-PROVENCE

[990 rows x 2 columns]

In [8]:
energies = get_data('energies')
energies

successfully connected to postgres+psycopg2://sandrinevuachet:postgres@localhost:5432/final_project

   id name
0   1    E
1   2    G

In [4]:
get_data('operators')
operators

successfully connected to postgres+psycopg2://sandrinevuachet:postgres@localhost:5432/final_project

   id     name
0   1   Enedis
1   2      RTE
2   3     GRDF
3   4  GRT_GAZ
4   5   Teréga

In [5]:
get_data('deliveries')

successfully connected to postgres+psycopg2://sandrinevuachet:postgres@localhost:5432/final_project

,id,year,iris_code,consumption,address,sector_id,operator_id,energy_id,city_id
0,1,2018,010040101,"1,073901e+02",82 RUE DES MOUETTES,2,3,2,1
1,2,2018,010040101,"1,151224e+02",84 RUE DES MOUETTES,2,3,2,1
2,3,2018,010040101,"1,236034e+03",36 ALLEE DE LA BARBOTIERE,3,3,2,1
3,4,2018,010040101,"1,487440e+03",AVENUE LEON BLUM,3,3,2,1
4,5,2018,010040101,"1,595118e+02",54 AVENUE PAUL PAINLEVE,2,3,2,1
...,...,...,...,...,...,...,...,...,...
45294,45295,2019,060290126,"8,966909e+01",145 AVENUE FRANCIS TONNER,2,1,1,578
45295,45296,2019,060290126,"9,101742e+01",32 RUE AURELIENNE,2,1,1,578
45296,45297,2019,060290126,"9,505636e+01",2 BOULEVARD ETIENNE ASTEGIANO,2,1,1,578
45297,45298,2019,060290126,"9,530968e+01",20 AVENUE ANTHONY DOZOL,2,1,1,578
45298,45299,2019,060290126,"9,901728e+01",3 RUE DE ROQUEBILLIERE,2,1,1,578

In [6]:
get_data('sectors')

successfully connected to postgres+psycopg2://sandrinevuachet:postgres@localhost:5432/final_project

   id name
0   1    I
1   2    R
2   3    T
3   4    A
4   5    X

In [7]:
get_data('addresses')

successfully connected to postgres+psycopg2://sandrinevuachet:postgres@localhost:5432/final_project

          id                         name  city_id
0          1          2 RUE DE VILLENEUVE      375
1          2  8 RUE PIERRE ET MARIE CURIE        5
2          3        80  CHEMIN DES MAURES      561
3          4           2 RUE PAUL STRAUSS      375
4          5            44 RUE DU PIC MAR      119
...      ...                          ...      ...
29793  29807  5  RUE LISSE DES CORDELIERS      990
29794  29808      17  AVENUE SAINT JEROME      990
29795  29809     39  AVENUE HENRI PONTIER      990
29796  29810           31  COURS GAMBETTA      990
29797  29811      22  AVENUE SAINT JEROME      990

[29798 rows x 3 columns]